#+TITLE: May 18, 2019 - June 3, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-05-18 Sat>
  :wpd-akshay196: 1
  :wpd-gandalfdwite: 1
  :wpd-jasonbraganza: 2
  :wpd-RJ722: 4
  :END:
** akshay196
*** UNIX and Linux System Administration Handbook - Part II [0/8]
    :PROPERTIES:
    :ESTIMATED: 17
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1555438527
    :TASKID: READ.1555438527
    :END:
    - [ ] Chapter  9. Cloud Computing                       ( 2h)
      - The cloud in context
      - Cloud platform choices
      - Cloud service fundamentals
      - Clouds: VPS quick start by platform
      - Cost control
    - [ ] Chapter 10. Logging                               ( 2h)
      - Log locations
      - The systemd journal
      - Syslog
      - Kernel and boot-time logging
      - Management and rotation of log files
      - Management of logs at scale
      - Logging policies
    - [ ] Chapter 11. Drivers and The Kernel                ( 2h)
      - Kernel chores for system administrators
      - Kernel version numbering
      - Devices and their drivers
      - Linux kernel configuration
      - FreeBSD kernel configuration
      - Loadable kernel modules
      - Booting
      - Booting alternate kernels in the cloud
      - Kernel errors
    - [ ] Chapter 12. Printing                              ( 2h)
      - CUPS printing
      - CUPS server administration
      - Troubleshooting tips
    - [ ] Chapter 13. TCP/IP Networking                     ( 3h)
      - TCP/IP and its relationship to the Internet
      - Networking basics
      - Packet addressing
      - IP addresses: the gory details
      - Routing
      - IPv4 ARP and IPv6 neighbor discovery
      - DHCP: the Dynamic Host Configuration Protocol
      - Security issues
      - Basic network configuration
      - Linux networking
      - FreeBSD networking
      - Network troubleshooting
      - Network monitoring
      - Firewalls and NAT
      - Cloud networking
    - [ ] Chapter 14. Physical Networking                   ( 2h)
      - Ethernet: the Swiss Army knife of networking
      - Wireless: Ethernet for nomads
      - SDN: software-defined networking
      - Network testing and debugging
      - Building wiring
      - Network design issues
      - Management issues
      - Recommended vendors
    - [ ] Chapter 15. IP Routing                            ( 2h)
      - Packet forwarding: a closer look
      - Routing daemons and routing protocols
      - Protocols on parade
      - Routing protocol multicast coordination
      - Routing strategy selection criteria
      - Routing daemons
      - Cisco routers
    - [ ] Chapter 16. DNS: Domain Name System               ( 2h)
      - DNS architecture
      - DNS for lookups
      - The DNS namespace
      - How DNS works
      - The DNS database
      - The BIND software
      - Split DNS and the view statement
      - BIND configuration examples
      - Zone file updating
      - DNS security issues
      - BIND debugging
** gandalfdwite
*** Data Structure and Algorithmic Thinking with Python - Part III [0/4]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    - [ ] 6. Trees                             ( 4h)
    - [ ] 7. Priority Queues & Heaps           ( 1h)
    - [ ] 8. Disjoint Sets ADT                 ( 1h)
    - [ ] 9. Graph Algorithms                  ( 2h)
*** Python Web Training [0/1]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER:    gandalfdwite
    :ID:       EVENT.1558150556
    :TASKID:   EVENT.1558150556
    :END:
    - [ ] Python online training  (3h)
*** Unix Concepts & Applications by Sumitabha Das - Part III [0/3]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   - [ ] 5. Handling Ordinary files              ( 2h)
   - [ ] 6. Basic file attributes                ( 1h)
   - [ ] 7. Vi editor                            ( 3h)
** jasonbraganza
*** DONE Read and Practice alongside the Mastering Emacs book - Part II [3/3]
    CLOSED: [2019-05-22 Wed 13:19]
   :PROPERTIES: 
   :ESTIMATED: 15
   :ACTUAL:  0.31
   :OWNER: jasonbraganza
   :ID: READ.1557143830
   :TASKID: READ.1557143830
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-22 Wed 13:17]--[2019-05-22 Wed 13:19] =>  0:02
   CLOCK: [2019-05-22 Wed 13:10]--[2019-05-22 Wed 13:17] =>  0:07
   CLOCK: [2019-05-22 Wed 12:48]--[2019-05-22 Wed 13:10] =>  0:22
   :END:
   - [X] The Theory of Editing    (05h)
   - [X] The Practicals of Emacs  (05h)
   - [X] Conclusion               (05h)
*** TODO IN_PROGRESS Work at French, in the Fluent forever app - Part II [5/14]
   :PROPERTIES:
   :ESTIMATED: 17
   :ACTUAL:   2.68
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-22 Wed 09:34]--[2019-05-22 Wed 10:35] =>  1:01
   CLOCK: [2019-05-22 Wed 08:58]--[2019-05-22 Wed 09:34] =>  0:36
   CLOCK: [2019-05-18 Sat 20:40]--[2019-05-18 Sat 20:44] =>  0:04
   CLOCK: [2019-05-18 Sat 15:40]--[2019-05-18 Sat 16:40] =>  1:00
   :END:
   - [X] Write a short blog post. Do Review. (1h)
   - [X] Work a pronunciation video (1h)
   - [X] Completed 4 pronunciation lessons (1h)
   - [X] Created 3 grammar flashcards. did 4 review sessions (1h)
   - [X] Work in the app. fill in specific tasks once done (1h)
   - [ ] Write a short blog post. Do Review. (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Write a short blog post. Do Review. (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
   - [ ] Work in the app. fill in specific tasks once done (1h)
*** DONE Read Pym Book [24/24]
    CLOSED: [2019-05-22 Wed 12:45]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   3.90
   :OWNER: jasonbraganza
   :ID: READ.1558193338
   :TASKID: READ.1558193338
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-22 Wed 12:31]--[2019-05-22 Wed 12:45] =>  0:14
   CLOCK: [2019-05-22 Wed 10:36]--[2019-05-22 Wed 12:15] =>  1:39
   CLOCK: [2019-05-21 Tue 14:17]--[2019-05-21 Tue 14:23] =>  0:06
   CLOCK: [2019-05-21 Tue 13:25]--[2019-05-21 Tue 13:35] =>  0:10
   CLOCK: [2019-05-21 Tue 12:23]--[2019-05-21 Tue 13:10] =>  0:47
   CLOCK: [2019-05-21 Tue 12:16]--[2019-05-21 Tue 12:23] =>  0:07
   CLOCK: [2019-05-21 Tue 11:59]--[2019-05-21 Tue 12:16] =>  0:17
   CLOCK: [2019-05-21 Tue 11:25]--[2019-05-21 Tue 11:59] =>  0:34
   :END:
   - [X] Installation
   - [X] The Beginning
   - [X] Using mu editor
   - [X] Variables and Datatypes
   - [X] Operators and expressions
   - [X] If-else , the control flow
   - [X] Looping
   - [X] Data Structures
   - [X] Strings
   - [X] Functions
   - [X] File handling
   - [X] Exceptions
   - [X] Class
   - [X] Modules
   - [X] Collections module
   - [X] Using VS Code as your primary Python editor
   - [X] PEP8 Guidelines
   - [X] Iterators, generators and decorators
   - [X] Virtualenv
   - [X] Type hinting and annotations
   - [X] Simple testing in Python
   - [X] A project structure
   - [X] Building command line applications with Click
   - [X] Introduction to Flask
** RJ722
*** Read "The Great Novel of India" [0/18]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:
    :OWNER: RJ722
    :ID: READ.1557996292
    :TASKID: READ.1557996292
    :END:
    - [ ] The First Book
    - [ ] The Second Book
    - [ ] The Third Book
    - [ ] The Fourth Book
    - [ ] The Fifth Book
    - [ ] The Sixth Book
    - [ ] The Seventh Book
    - [ ] The Eighth Book
    - [ ] The Ninth Book
    - [ ] The Tenth Book
    - [ ] The Eleventh Book
    - [ ] The Twelfth Book
    - [ ] The Thirteenth Book
    - [ ] The Fourteenth Book
    - [ ] The Fifteenth Book
    - [ ] The Sixteenth Book
    - [ ] The Seventeenth Book
    - [ ] The Eigteenth Book
*** Write blog post [0/3]
    :PROPERTIES:
    :ESTIMATED: 26
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1558355651
    :TASKID: WRITE.1558355651
    :END:
    - [ ] Week 1
    - [ ] Week 2
    - [ ] Week 3
*** Build the profile
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1558159427
    :TASKID: TASK.1558159427
    :END:
    - [ ] Follow tags and technologies that you know about
    - [ ] Write a bio for the site
    - [ ] Review their guides
*** Gain 200 reputation
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1558159594
    :TASKID: WRITE.1558159594
    :END:
    Quality answering for 4, 5 questions should suffice.
*** Revise the forgotten history (first three courses)
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1558163860
    :TASKID: TASK.1558163860
    :END:
>>>>>>> RJ722/operation-blue-moon-master
